Repository: artefactual/archivematica-docs
Catalog: locale/*/LC_MESSAGES/admin-manual/security/security.po
Languages: pt_br

source: Security
pt_br: Segurança

source: Once you've set up Archivematica it's a good practice, for the sake of security, to change the default passwords.
pt_br: Depois de configurar o Archivematica, é uma boa prática, por motivos de segurança, alterar as senhas padrão.

source: This page outlines various security settings and configurations in Archivematica.
pt_br: Esta página descreve várias instalações e configurações de segurança no Archivematica.

source: Elasticsearch access control
pt_br: Controle de acesso Elasticsearch

source: The only way to limit access to Elasticsearch, currently, is using your server's firewall configuration. You'll likely want to configure your server's firewall to limit access to Elasticsearch's TCP/IP port (9200). It is recommended to only allow access by 127.0.0.1 (the server itself) and the IPs of any other servers or workstations that should be able to access it.
pt_br: A única maneira de limitar o acesso ao Elasticsearch, atualmente, é usar a configuração de firewall do seu servidor. Você provavelmente desejará configurar o firewall do seu servidor para limitar o acesso à porta TCP / IP do Elasticsearch (9200). Recomenda-se que apenas permita o acesso por 127.0.0.1 (o próprio servidor) e os IPs de quaisquer outros servidores ou estações de trabalho que possam acessá-lo.

source: If you are using AtoM as your access system, remember to perform this task on your AtoM Elasticsearch index. Your AtoM site is more likely to be a public- facing IP and therefore this is an important step.
pt_br: Se você estiver usando o AtoM como seu sistema de acesso, lembre-se de executar essa tarefa em seu índice AtoM Elasticsearch. É mais provável que o seu site AtoM seja um IP voltado para o público e, portanto, esse é um passo importante.

source: To further enhance your Elasticsearch index's security make the following changes in your Elasticsearch ``/etc/elasticsearch/elasticsearch.yml`` file:
pt_br: Para melhorar ainda mais a segurança do seu índice Elasticsearch, faça as seguintes alterações em seu Elasticsearch ``/etc/elasticsearch/elasticsearch.yml`` file:

source: Then, ``/etc/init.d/elasticsearch restart``.
pt_br: Então, ``/etc/init.d/elasticsearch restart``.

source: You should create a new MySQL user or change the password of the default ``archivematica`` MySQL user. The change the password of the default user, enter the following into the command-line:
pt_br: Você deve criar um novo usuário MySQL ou alterar a senha padrão do ``archivematica`` usuário do MySQL.

source: Once you've done this you can change Archivematica's MySQL database access credentials by editing these two files:
pt_br: Depois de fazer isso, você pode alterar as credenciais de acesso ao banco de dados MySQL do Archivematica editando esses dois arquivos:

source: ``/etc/archivematica/archivematicaCommon/dbsettings`` (change the ``user`` and ``password`` settings)
pt_br: ``/etc/archivematica/archivematicaCommon/dbsettings`` (mude as configurações ``usuário`` e ``senha``)

source: ``/usr/share/archivematica/dashboard/settings/common.py`` (change the ``USER`` and ``PASSWORD`` settings in the ``DATABASES`` section)
pt_br: ``/usr/share/archivematica/dashboard/settings/common.py`` (mude as configurações `` USUÁRIO`` e `` SENHA`` na seção `` BASE DE DADOS``)

source: Archivematica does not presently support secured MySQL communication so MySQL should be run locally or on a secure, isolated network. See :issue:`1645`.
pt_br: O Archivematica atualmente não suporta comunicação segura com o MySQL, então o MySQL deve ser executado localmente ou em uma rede segura e isolada. Veja :problema:`1645`.

source: In addition to changing the MySQL credentials, if you've also installed AtoM you'll want to set the password for it as well. Note that after changing your AtoM credentials you should update the credentials on the :ref:`AtoM DIP upload administration page <admin-dashboard-atom>` as well.
pt_br: Além de alterar as credenciais do MySQL, se você também instalou o AtoM, também deverá definir a senha para ele. Observe que depois de alterar suas credenciais AtoM você deve atualizar as credenciais no :ref:`AtoM DIP upload administration page <admin-dashboard-atom>` também.

source: Archivematica relies on the German server for queuing work that needs to be done. Gearman currently doesn't support secured connections so Gearman should be run locally or on a secure, isolated network. See :issue:`1345`.
pt_br: O Archivematica depende do German para o trabalho de enfileiramento que precisa ser feito. O Gearman atualmente não suporta conexões seguras, portanto, o Gearman deve ser executado localmente ou em uma rede segura e isolada. Veja: problema: `1345`.

source: User security
pt_br: Segurança do usuário

source: We added support for two authentication backends in Archivematica 1.7: LDAP and Shibboleth. Authentication backends provide an extensible system for when a ``username`` and ``password`` stored with the user model need to be authenticated against a different service than the default.
pt_br: Adicionamos suporte para dois backends de autenticação no Archivematica 1.7: LDAP e Shibboleth. Os backends de autenticação fornecem um sistema extensível para quando um ``nome de usuário`` e ``senha`` armazenado com o modelo do usuário precisam ser autenticados em um serviço diferente do padrão.

source: This feature relies on the `authentication infrastructure <django-auth-infra_>`_ provided by the Django web framework. Check out their docs for more details!
pt_br: Esse recurso depende da infraestrutura de autenticação<django-auth-infra_>`_ fornecido pelo framework web Django. Confira seus docs para mais detalhes!

source: Please note that this is a new feature as of Archivematica 1.7 that has been minimally tested outside of the development environment. If you experience any problems with the feature, please consider creating a `GitHub issue <am-gh-issues_>`_ or creating a post in the `Archivematica Google Group <am-google-groups_>`_. The configuration mechanism has some rough edges so it is recommended for advanced users only.
pt_br: Observe que esse é um novo recurso do Archivematica 1.7 que foi testado minimamente fora do ambiente de desenvolvimento. Se você tiver algum problema com o recurso, considere a possibilidade de criar uma questão no GitHub<am-gh-issues_>`_ ou escreva um post no `Archivematica Google Group<am-google-groups_>`_. O mecanismo de configuração possui algumas arestas, portanto é recomendado apenas para usuários avançados.

source: LDAP setup
pt_br: instalação LDAP

source: `LDAP <ldap_>`_ is a directory service protocol used for, among other things, authentication and authorization. This feature allows administrators to deploy the Archivematica Dashboard Django application with LDAP authentication.
pt_br: `LDAP <ldap_>`_ é um protocolo de serviço de diretório usado para, entre outras coisas, autenticação e autorização. Esse recurso permite que os administradores implantem o aplicativo Django do painel de controle do Archivematica com autenticação LDAP.

source: This functionality has not been made available yet in the Storage Service.
pt_br: Esta funcionalidade ainda não foi disponibilizada no Serviço de Armazenamento.

source: LDAP backend configuration
pt_br: Configuração backend LDAP

source: Enable the authentication backend using the environment variable ``ARCHIVEMATICA_DASHBOARD_DASHBOARD_LDAP_AUTHENTICATION``. You can find more details about this environment string in the `configuration document <am-dashboard-config_>`_.
pt_br: Ativar o backend de autenticação usando a variável de ambiente ``ARCHIVEMATICA_DASHBOARD_DASHBOARD_LDAP_AUTHENTICATION``. Você pode encontrar mais detalhes sobre esta cadeia de ambiente no documento de configuração <am-dashboard-config_>`_.

source: Customize the ``ldap_auth.py`` settings module as needed. Open the file to find what are the existing environment variable lookups. You can inject the configuration via the environment string or changing the settings mode manually.
pt_br: Personalize o módulo de instalação `` ldap_auth.py`` conforme necessário. Abra o arquivo para localizar quais são as pesquisas de variáveis ​​de ambiente existentes. Você pode introduzir a configuração através da string de ambiente ou alterar o modo da instalações manualmente.

source: Restart the Archivematica Dashboard.
pt_br: Reinicie o painel do Archivematica.

source: Shibboleth setup
pt_br: instalação Shibboleth

source: `Shibboleth <shibboleth_>`_ is a federated identity solution that provides Single Sign-On authentication and authorization. This feature allows administrators to deploy both the Archivematica Dashboard and Storage Service Django applications with Shibboleth authentication.
pt_br: `Shibboleth <shibboleth_>`_ é uma solução de identidade federada que fornece autenticação e autorização do Single Sign-On. Esse recurso permite que os administradores implantem os aplicativos Storage Server Django e Archivematica Dashboard com a autenticação Shibboleth.

source: Shibboleth backend configuration in Archivematica Dashboard
pt_br: Configuração de backend do Shibboleth no Archivematica Dashboard

source: Enable the authentication backend using the environment variable ``SS_SHIBBOLETH_AUTHENTICATION``. You can find more details about this environment string in the `configuration document <am-dashboard-config_>`_.
pt_br: Ativar o backend de autenticação usando a variável de ambiente``SS_SHIBBOLETH_AUTHENTICATION``. Você pode encontrar mais detalhes sobre este srting de ambiente no `documento de configuração <am-dashboard-config_>`_.

source: Customize the ``shibboleth_auth.py`` settings module as needed.
pt_br: Personalize o ``shibboleth_auth.py`` módulo de instalações, conforme necessário.

source: Shibboleth backend configuration in Storage Service
pt_br: Configuração de backend do Shibboleth no serviço de armazenamento

source: Enable the authentication backend using the environment variable ``SS_SHIBBOLETH_AUTHENTICATION``. Assign a string value ``true`` to enable it.
pt_br: Habilitar o backend de autenticação usando a variável de ambiente ``SS_SHIBBOLETH_AUTHENTICATION``. Atribua um valor de string ``true`` para habilitar.

source: Customize the ``base.py`` settings module as needed.
pt_br: Personalize o módulo de instalação ``base.py`` conforme necessário.

source: Restart the Storage Service.
pt_br: Reinicie o serviço de armazenamento.

source: :ref:`Back to the top <security>`
pt_br: :ref:`Voltar ao topo <security>`
